doc/html/elements/restful_overview.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Nirogen 2.x Documentation</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Nirogen 2.x Documentation"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-18 03:24:46 CDT"/>
<meta name="author" content="Steffen Panning"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href="../stylesheet.css" rel="stylesheet" type="text/css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Nirogen 2.x Documentation</h1>

<p><a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html"><b>Elements</b></a> | <a href="../actions.html">Actions</a> | <a href="../validators.html">Validators</a> | <a href="../handlers.html">Handlers</a> | <a href="../config.html">Configuration Options</a> | <a href="../about.html">About</a>
<div class=headline>Nitrogen Restful Elements</div>

</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Overview</a></li>
<li><a href="#sec-2">2 How it works</a></li>
<li><a href="#sec-3">3 Replaced and new elements</a></li>
<li><a href="#sec-4">4 Supported elements</a></li>
<li><a href="#sec-5">5 No support for validators</a></li>
<li><a href="#sec-6">6 Example</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">


<p>
  Restful elements introduce the possibility to create forms that don't
  depend on AJAX/Javascript. This is sometimes useful, for example if you
  want to provide a fallback option when a client does not support
  javascript or sits behind a firewall that filters active content.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> How it works</h2>
<div class="outline-text-2" id="text-2">


<p>
  Restful requests work a little different compared to the rest of
  Nitrogen. They don't use the event mechanism. Instead you have to
  render the reply either on a different page or check if
  wf:q(restful_method) is set to "post" or "get" depending on the
  method of the form.  Form elements that don't rely on javascript are
  useable in restful_form elements. The elements that are supported are
  described below.
</p>
<p>
  Each control within a #restful_form{} element will submit its Nitrogen
  id as the name of the field, unless overridden by specifying an html_name
  on the restful elements.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Replaced and new elements</h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3"></span> New Elements</h3>
<div class="outline-text-3" id="text-3-1">


<ul>
<li><a href="./restful_form.html">restful_form</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3"></span> Replaced elements</h3>
<div class="outline-text-3" id="text-3-2">

<p>   Some elements are replaced with restful_ counterparts:
</p>
<p>
<a name="1" id="1"></a>
</p>
<ul>
<li><a href="./restful_submit.html">restful_submit</a> and <a href="./restful_reset.html">restful_reset</a> instead of <a href="./button.html">button</a> 
</li>
<li><a href="./restful_upload">restful_upload</a> instead of upload
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Supported elements</h2>
<div class="outline-text-2" id="text-4">


<ul>
<li><a href="./textbox.html">Textbox</a>
</li>
<li><a href="./textarea.html">Textarea</a>
</li>
<li><a href="./checkbox.html">Checkbox</a>
</li>
<li><a href="./dropdown.html">Dropdown</a>
</li>
<li><a href="./password.html">Password Box</a>
</li>
<li><a href="./hidden.html">Hidden Value</a>
</li>
<li><a href="./radio.html">Radio Button</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> No support for validators</h2>
<div class="outline-text-2" id="text-5">

<p>  Validators are not currently supported for restful_submit actions, so be sure extra sure to check your inputs.
</p>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Example</h2>
<div class="outline-text-2" id="text-6">




<pre class="src src-erlang"><span class="org-keyword">case</span> <span class="org-type">wf</span>:<span class="org-type">q</span>(restful_method) <span class="org-keyword">of</span>
  <span class="org-string">"post"</span> -&gt;<span class="org-function-name"> </span>[
      <span class="org-comment-delimiter">% </span><span class="org-comment">this is code is executed after the submit button was pressed</span>

      #<span class="org-type">table</span>{rows=[
          #<span class="org-type">tablerow</span>{cells=[
              #<span class="org-type">tablecell</span>{text=<span class="org-string">"text_input"</span>},
              #<span class="org-type">tablecell</span>{text=<span class="org-type">wf</span>:<span class="org-type">q</span>(text_input)}
          ]}
       ]};
  <span class="org-variable-name">_else</span> -&gt;<span class="org-function-name"> </span>[
      <span class="org-comment-delimiter">% </span><span class="org-comment">this code is executed when restful_method is "get" </span>
      <span class="org-comment-delimiter">% </span><span class="org-comment">or undefined</span>

      #<span class="org-type">restful_form</span>{id=restful_form, method=post, body=[
         #<span class="org-type">table</span>{rows=[
              #<span class="org-type">tablerow</span>{cells=[
                  #<span class="org-type">tablecell</span>{text=<span class="org-string">"text_input"</span>},
                  #<span class="org-type">tablecell</span>{body=[#<span class="org-type">textbox</span>{id=text_input}]}
             ]}
          ]},
          #<span class="org-type">restful_reset</span>{},
          #<span class="org-type">restful_submit</span>{}
       ]}
  ]
<span class="org-keyword">end</span>
</pre>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-10-18 03:24:46 CDT</p>
<p class="author">Author: Steffen Panning</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/elements/restful_overview.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
